Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_regdef.h
/** \brief  CERBERUS Service requests */
typedef volatile struct _Ifx_SRC_CERBERUS
{
    Ifx_SRC_SRCR SR[2];                     /**< \brief 0, Cerberus Service Request */
} Ifx_SRC_CERBERUS;

/** \brief  CIF Service requests */
typedef volatile struct _Ifx_SRC_CIF
{
    Ifx_SRC_SRCR MI;                        /**< \brief 0, CIF MI Service Request */
    Ifx_SRC_SRCR MIEP;                      /**< \brief 4, CIF MI EP Service Request */
    Ifx_SRC_SRCR ISP;                       /**< \brief 8, CIF ISP Service Request */
    Ifx_SRC_SRCR MJPEG;                     /**< \brief C, CIF MJPEG Service Request */
} Ifx_SRC_CIF;

/** \brief  CPU Service requests */
typedef volatile struct _Ifx_SRC_CPU
{
    Ifx_SRC_SRCR SB;                        /**< \brief 0, CPU Software Breakpoint Service Request */
} Ifx_SRC_CPU;

/** \brief  DAM Service requests */
typedef volatile struct _Ifx_SRC_DAM
{
    Ifx_SRC_SRCR LI0;                       /**< \brief 0, DAM Limit 0 Service Request x */
    Ifx_SRC_SRCR RI0;                       /**< \brief 4, DAM Ready 0 Service Request x */
    Ifx_SRC_SRCR LI1;                       /**< \brief 8, DAM Limit 1 Service Request x */
    Ifx_SRC_SRCR RI1;                       /**< \brief C, DAM Ready 1 Service Request x */
    Ifx_SRC_SRCR DR;                        /**< \brief 10, DAM DMA Ready Service Request x */
    Ifx_SRC_SRCR ERR;                       /**< \brief 14, DAM DMA Error Service Request x */
} Ifx_SRC_DAM;

/** \brief  DMA Service requests */
typedef volatile struct _Ifx_SRC_DMA
{
    Ifx_SRC_SRCR ERR;                       /**< \brief 0, DMA Error Service Request */
    unsigned char reserved_4[12];           /**< \brief 4, \internal Reserved */
    Ifx_SRC_SRCR CH[128];                   /**< \brief 10, DMA Channel Service Request */
} Ifx_SRC_DMA;

/** \brief  DSADC Service requests */
typedef volatile struct _Ifx_SRC_DSADC
{
    Ifx_SRC_SRCR SRM;                       /**< \brief 0, DSADC SRM Service Request */
    Ifx_SRC_SRCR SRA;                       /**< \brief 4, DSADC SRA Service Request */
} Ifx_SRC_DSADC;

/** \brief  ERAY Service requests */
typedef volatile struct _Ifx_SRC_ERAY
{
    Ifx_SRC_SRCR INT[2];                    /**< \brief 0, E-RAY  Service Request */
    Ifx_SRC_SRCR TINT[2];                   /**< \brief 8, E-RAY  Timer Interrupt Service Request */
    Ifx_SRC_SRCR NDAT[2];                   /**< \brief 10, E-RAY  New Data Service Request */
    Ifx_SRC_SRCR MBSC[2];                   /**< \brief 18, E-RAY  Message Buffer Status Changed Service Request */
    Ifx_SRC_SRCR OBUSY;                     /**< \brief 20, E-RAY  Output Buffer Busy Service Request */
    Ifx_SRC_SRCR IBUSY;                     /**< \brief 24, E-RAY  Input Buffer Busy Service Request */
    unsigned char reserved_28[8];           /**< \brief 28, \internal Reserved */
} Ifx_SRC_ERAY;

/** \brief  ETH Service requests */
typedef volatile struct _Ifx_SRC_ETH
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, Ethernet Service Request */
    unsigned char reserved_4[28];           /**< \brief 4, \internal Reserved */
} Ifx_SRC_ETH;

/** \brief  FCE Service requests */
typedef volatile struct _Ifx_SRC_FCE
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, FCE Error Service Request */
    unsigned char reserved_4[12];           /**< \brief 4, \internal Reserved */
} Ifx_SRC_FCE;

/** \brief  GPSR Service requests */
typedef volatile struct _Ifx_SRC_GPSR
{
    Ifx_SRC_SRCR SR0;                       /**< \brief 0, GPSR Group 0 */
    Ifx_SRC_SRCR SR1;                       /**< \brief 4, GPSR Group 1 */
    Ifx_SRC_SRCR SR2;                       /**< \brief 8, GPSR Group 2 */
    Ifx_SRC_SRCR SR3;                       /**< \brief C, GPSR Group 3 */
    Ifx_SRC_SRCR SR4;                       /**< \brief 10, GPSR Group 4 */
    Ifx_SRC_SRCR SR5;                       /**< \brief 14, GPSR Group 5 */
    Ifx_SRC_SRCR SR6;                       /**< \brief 18, GPSR Group 6 */
    Ifx_SRC_SRCR SR7;                       /**< \brief 1C, GPSR Group 7 */
} Ifx_SRC_GPSR;

/** \brief  GPT12 Service requests */
typedef volatile struct _Ifx_SRC_GPT12
{
    Ifx_SRC_SRCR CIRQ;                      /**< \brief 0, GPT12 CAPREL Service Request */
    Ifx_SRC_SRCR T2;                        /**< \brief 4, GPT12 T2 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T3;                        /**< \brief 8, GPT12 T3 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T4;                        /**< \brief C, GPT12 T4 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T5;                        /**< \brief 10, GPT12 T5 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T6;                        /**< \brief 14, GPT12 T6 Overflow/Underflow Service Request */
    unsigned char reserved_18[8];           /**< \brief 18, \internal Reserved */
} Ifx_SRC_GPT12;

/** \brief  GTM Service requests */
typedef volatile struct _Ifx_SRC_GTM
{
    Ifx_SRC_SRCR AEIIRQ;                    /**< \brief 0, GTM AEI Shared Service Request */
    Ifx_SRC_SRCR ARUIRQ[3];                 /**< \brief 4, GTM ARU Shared Service Request */
    Ifx_SRC_SRCR BRCIRQ;                    /**< \brief 10, GTM BRC Shared Service Request */
    Ifx_SRC_SRCR CMPIRQ;                    /**< \brief 14, GTM CMP Shared Service Request */
    Ifx_SRC_SRCR SPEIRQ[6];                 /**< \brief 18, GTM SPE Shared Service Request */
    Ifx_SRC_SRCR PSM[3][8];                 /**< \brief 30, GTM PSM 0 Shared Service Request */
    Ifx_SRC_SRCR DPLL[27];                  /**< \brief 90, GTM DPLL Service Request */
    unsigned char reserved_FC[4];           /**< \brief FC, \internal Reserved */
    Ifx_SRC_SRCR ERR;                       /**< \brief 100, GTM Error Service Request */
    unsigned char reserved_104[28];         /**< \brief 104, \internal Reserved */
    Ifx_SRC_SRCR TIM[8][8];                 /**< \brief 120, GTM TIM 0 Shared Service Request */
    unsigned char reserved_220[32];         /**< \brief 220, \internal Reserved */
    Ifx_SRC_SRCR MCS[10][8];                /**< \brief 240, GTM MCS 0 Shared Service Request */
    unsigned char reserved_380[32];         /**< \brief 380, \internal Reserved */
    Ifx_SRC_SRCR TOM[6][8];                 /**< \brief 3A0, GTM TOM 0 Shared Service Request */
    unsigned char reserved_460[32];         /**< \brief 460, \internal Reserved */
    Ifx_SRC_SRCR ATOM[12][4];               /**< \brief 480, GTM ATOM 0 Shared Service Request */
    unsigned char reserved_540[32];         /**< \brief 540, \internal Reserved */
    Ifx_SRC_SRCR MCSW[10];                  /**< \brief 560, GTM Multi Channel Sequencer Service Request 0 */
} Ifx_SRC_GTM;

/** \brief  HSCT Service requests */
typedef volatile struct _Ifx_SRC_HSCT
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, HSCT Service Request */
} Ifx_SRC_HSCT;

/** \brief  HSM Service requests */
typedef volatile struct _Ifx_SRC_HSM
{
    Ifx_SRC_SRCR HSM[2];                    /**< \brief 0, HSM Service Request */
} Ifx_SRC_HSM;

