Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_regdef.h
/** \brief  HSSL Service requests */
typedef volatile struct _Ifx_SRC_HSSL
{
    Ifx_SRC_HSSL_CH CH[4];                  /**< \brief 0, HSSL Service requests */
    Ifx_SRC_SRCR EXI;                       /**< \brief 40, Exception Service Request */
} Ifx_SRC_HSSL;

/** \brief  I2C Service requests */
typedef volatile struct _Ifx_SRC_I2C
{
    Ifx_SRC_SRCR DTR;                       /**< \brief 0, I2C Data Transfer Request */
    Ifx_SRC_SRCR ERR;                       /**< \brief 4, I2C Error Service Request */
    Ifx_SRC_SRCR P;                         /**< \brief 8, I2C Kernel Service Request */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
} Ifx_SRC_I2C;

/** \brief  MSC Service requests */
typedef volatile struct _Ifx_SRC_MSC
{
    Ifx_SRC_SRCR SR0;                       /**< \brief 0, MSC Service Request 0 */
    Ifx_SRC_SRCR SR1;                       /**< \brief 4, MSC Service Request 1 */
    Ifx_SRC_SRCR SR2;                       /**< \brief 8, MSC Service Request 2 */
    Ifx_SRC_SRCR SR3;                       /**< \brief C, MSC Service Request 3 */
    Ifx_SRC_SRCR SR4;                       /**< \brief 10, MSC Service Request 4 */
} Ifx_SRC_MSC;

/** \brief  PMS Service requests */
typedef volatile struct _Ifx_SRC_PMS
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, Power Management System Service Request  */
} Ifx_SRC_PMS;

/** \brief  PSI5 Service requests */
typedef volatile struct _Ifx_SRC_PSI5
{
    Ifx_SRC_SRCR SR[8];                     /**< \brief 0, PSI5 Service Request */
} Ifx_SRC_PSI5;

/** \brief  PSI5S Service requests */
typedef volatile struct _Ifx_SRC_PSI5S
{
    Ifx_SRC_SRCR SR[8];                     /**< \brief 0, PSI5-S Service Request */
} Ifx_SRC_PSI5S;

/** \brief  QSPI Service requests */
typedef volatile struct _Ifx_SRC_QSPI
{
    Ifx_SRC_SRCR TX;                        /**< \brief 0, QSPI Transmit Service Request */
    Ifx_SRC_SRCR RX;                        /**< \brief 4, QSPI Receive Service Request */
    Ifx_SRC_SRCR ERR;                       /**< \brief 8, QSPI Error Service Request */
    Ifx_SRC_SRCR PT;                        /**< \brief C, QSPI Phase Transition Service Request */
    Ifx_SRC_SRCR U;                         /**< \brief 10, QSPI User Defined Service Request */
} Ifx_SRC_QSPI;

/** \brief  RIF Service requests */
typedef volatile struct _Ifx_SRC_RIF
{
    Ifx_SRC_SRCR ERR;                       /**< \brief 0, Radar Interface  Error Service Request */
    Ifx_SRC_SRCR INT;                       /**< \brief 4, Radar Interface  Service Request */
} Ifx_SRC_RIF;

/** \brief  SENT Service requests */
typedef volatile struct _Ifx_SRC_SENT
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, SENT TRIG Service Request */
} Ifx_SRC_SENT;

/** \brief  SMU Service requests */
typedef volatile struct _Ifx_SRC_SMU
{
    Ifx_SRC_SRCR SR[3];                     /**< \brief 0, SMU Service Request */
} Ifx_SRC_SMU;

/** \brief  SPU Service requests */
typedef volatile struct _Ifx_SRC_SPU
{
    Ifx_SRC_SRCR ERR;                       /**< \brief 0, Signal Processing Unit  Error Service Request */
    Ifx_SRC_SRCR INT;                       /**< \brief 4, Signal Processing Unit  Service Request */
} Ifx_SRC_SPU;

/** \brief  STM Service requests */
typedef volatile struct _Ifx_SRC_STM
{
    Ifx_SRC_SRCR SR0;                       /**< \brief 0, System Timer  Service Request 0 */
    Ifx_SRC_SRCR SR1;                       /**< \brief 4, System Timer  Service Request 1 */
} Ifx_SRC_STM;

/** \brief  VADCCG Service requests */
typedef volatile struct _Ifx_SRC_VADCCG
{
    Ifx_SRC_SRCR SR0;                       /**< \brief 0, VADC Common Group  Service Request 0 */
    Ifx_SRC_SRCR SR1;                       /**< \brief 4, VADC Common Group  Service Request 1 */
    Ifx_SRC_SRCR SR2;                       /**< \brief 8, VADC Common Group  Service Request 2 */
    Ifx_SRC_SRCR SR3;                       /**< \brief C, VADC Common Group  Service Request 3 */
} Ifx_SRC_VADCCG;

/** \brief  VADCG Service requests */
typedef volatile struct _Ifx_SRC_VADCG
{
    Ifx_SRC_SRCR SR0;                       /**< \brief 0, VADC Group  Service Request 0 */
    Ifx_SRC_SRCR SR1;                       /**< \brief 4, VADC Group  Service Request 1 */
    Ifx_SRC_SRCR SR2;                       /**< \brief 8, VADC Group  Service Request 2 */
    Ifx_SRC_SRCR SR3;                       /**< \brief C, VADC Group  Service Request 3 */
} Ifx_SRC_VADCG;

/** \brief  XBAR Service requests */
typedef volatile struct _Ifx_SRC_XBAR
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, XBAR_SRI Service Request */
} Ifx_SRC_XBAR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Src_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  AGBT Service requests */
typedef volatile struct _Ifx_SRC_GAGBT
{
    Ifx_SRC_AGBT AGBT[1];                   /**< \brief 0, AGBT Service requests */
} Ifx_SRC_GAGBT;

/** \brief  ASCLIN Service requests */
typedef volatile struct _Ifx_SRC_GASCLIN
{
    Ifx_SRC_ASCLIN ASCLIN[8];               /**< \brief 0, ASCLIN Service requests */
} Ifx_SRC_GASCLIN;

/** \brief  BCU Service requests */
typedef volatile struct _Ifx_SRC_GBCU
{
    Ifx_SRC_BCU BCU;                        /**< \brief 0, BCU Service requests */
} Ifx_SRC_GBCU;

/** \brief  CAN Service requests */
typedef volatile struct _Ifx_SRC_GCAN
{
    Ifx_SRC_CAN CAN[3];                     /**< \brief 0, CAN Service requests */
} Ifx_SRC_GCAN;

/** \brief  CCU6 Service requests */
typedef volatile struct _Ifx_SRC_GCCU6
{
    Ifx_SRC_CCU6 CCU6[2];                   /**< \brief 0, CCU6 Service requests */
} Ifx_SRC_GCCU6;

