Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_regdef.h
/** \brief  CERBERUS Service requests */
typedef volatile struct _Ifx_SRC_GCERBERUS
{
    Ifx_SRC_CERBERUS CERBERUS;              /**< \brief 0, CERBERUS Service requests */
} Ifx_SRC_GCERBERUS;

/** \brief  CIF Service requests */
typedef volatile struct _Ifx_SRC_GCIF
{
    Ifx_SRC_CIF CIF[1];                     /**< \brief 0, CIF Service requests */
} Ifx_SRC_GCIF;

/** \brief  CPU Service requests */
typedef volatile struct _Ifx_SRC_GCPU
{
    Ifx_SRC_CPU CPU[6];                     /**< \brief 0, CPU Service requests */
} Ifx_SRC_GCPU;

/** \brief  DAM Service requests */
typedef volatile struct _Ifx_SRC_GDAM
{
    Ifx_SRC_DAM DAM[2];                     /**< \brief 0, DAM Service requests */
} Ifx_SRC_GDAM;

/** \brief  DMA Service requests */
typedef volatile struct _Ifx_SRC_GDMA
{
    Ifx_SRC_DMA DMA[1];                     /**< \brief 0, DMA Service requests */
} Ifx_SRC_GDMA;

/** \brief  DSADC Service requests */
typedef volatile struct _Ifx_SRC_GDSADC
{
    Ifx_SRC_DSADC DSADC[14];                /**< \brief 0, DSADC Service requests */
} Ifx_SRC_GDSADC;

/** \brief  ERAY Service requests */
typedef volatile struct _Ifx_SRC_GERAY
{
    Ifx_SRC_ERAY ERAY[2];                   /**< \brief 0, ERAY Service requests */
} Ifx_SRC_GERAY;

/** \brief  ETH Service requests */
typedef volatile struct _Ifx_SRC_GETH
{
    Ifx_SRC_ETH ETH[1];                     /**< \brief 0, ETH Service requests */
} Ifx_SRC_GETH;

/** \brief  FCE Service requests */
typedef volatile struct _Ifx_SRC_GFCE
{
    Ifx_SRC_FCE FCE[1];                     /**< \brief 0, FCE Service requests */
} Ifx_SRC_GFCE;

/** \brief  GPSR Service requests */
typedef volatile struct _Ifx_SRC_GGPSR
{
    Ifx_SRC_GPSR GPSR[6];                   /**< \brief 0, GPSR Service requests */
} Ifx_SRC_GGPSR;

/** \brief  GPT12 Service requests */
typedef volatile struct _Ifx_SRC_GGPT12
{
    Ifx_SRC_GPT12 GPT12[1];                 /**< \brief 0, GPT12 Service requests */
} Ifx_SRC_GGPT12;

/** \brief  GTM Service requests */
typedef volatile struct _Ifx_SRC_GGTM
{
    Ifx_SRC_GTM GTM[1];                     /**< \brief 0, GTM Service requests */
} Ifx_SRC_GGTM;

/** \brief  HSCT Service requests */
typedef volatile struct _Ifx_SRC_GHSCT
{
    Ifx_SRC_HSCT HSCT[2];                   /**< \brief 0, HSCT Service requests */
} Ifx_SRC_GHSCT;

/** \brief  HSM Service requests */
typedef volatile struct _Ifx_SRC_GHSM
{
    Ifx_SRC_HSM HSM[1];                     /**< \brief 0, HSM Service requests */
} Ifx_SRC_GHSM;

/** \brief  HSSL Service requests */
typedef volatile struct _Ifx_SRC_GHSSL
{
    Ifx_SRC_HSSL HSSL[2];                   /**< \brief 0, HSSL Service requests */
} Ifx_SRC_GHSSL;

/** \brief  I2C Service requests */
typedef volatile struct _Ifx_SRC_GI2C
{
    Ifx_SRC_I2C I2C[2];                     /**< \brief 0, I2C Service requests */
} Ifx_SRC_GI2C;

/** \brief  MSC Service requests */
typedef volatile struct _Ifx_SRC_GMSC
{
    Ifx_SRC_MSC MSC[4];                     /**< \brief 0, MSC Service requests */
} Ifx_SRC_GMSC;

/** \brief  PMS Service requests */
typedef volatile struct _Ifx_SRC_GPMS
{
    Ifx_SRC_PMS PMS[4];                     /**< \brief 0, PMS Service requests */
} Ifx_SRC_GPMS;

/** \brief  PSI5 Service requests */
typedef volatile struct _Ifx_SRC_GPSI5
{
    Ifx_SRC_PSI5 PSI5[1];                   /**< \brief 0, PSI5 Service requests */
} Ifx_SRC_GPSI5;

/** \brief  PSI5S Service requests */
typedef volatile struct _Ifx_SRC_GPSI5S
{
    Ifx_SRC_PSI5S PSI5S[1];                 /**< \brief 0, PSI5S Service requests */
} Ifx_SRC_GPSI5S;

/** \brief  QSPI Service requests */
typedef volatile struct _Ifx_SRC_GQSPI
{
    Ifx_SRC_QSPI QSPI[6];                   /**< \brief 0, QSPI Service requests */
} Ifx_SRC_GQSPI;

/** \brief  RIF Service requests */
typedef volatile struct _Ifx_SRC_GRIF
{
    Ifx_SRC_RIF RIF[2];                     /**< \brief 0, RIF Service requests */
} Ifx_SRC_GRIF;

/** \brief  SENT Service requests */
typedef volatile struct _Ifx_SRC_GSENT
{
    Ifx_SRC_SENT SENT[10];                  /**< \brief 0, SENT Service requests */
} Ifx_SRC_GSENT;

/** \brief  SMU Service requests */
typedef volatile struct _Ifx_SRC_GSMU
{
    Ifx_SRC_SMU SMU[1];                     /**< \brief 0, SMU Service requests */
} Ifx_SRC_GSMU;

/** \brief  SPU Service requests */
typedef volatile struct _Ifx_SRC_GSPU
{
    Ifx_SRC_SPU SPU[2];                     /**< \brief 0, SPU Service requests */
} Ifx_SRC_GSPU;

/** \brief  STM Service requests */
typedef volatile struct _Ifx_SRC_GSTM
{
    Ifx_SRC_STM STM[6];                     /**< \brief 0, STM Service requests */
} Ifx_SRC_GSTM;

/** \brief  VADC Service requests */
typedef volatile struct _Ifx_SRC_GVADC
{
    Ifx_SRC_VADCG G[12];                    /**< \brief 0, VADCG Service requests */
    Ifx_SRC_SRCR SR0[8];                    /**< \brief C0, VADC Group 12 to 19 Service Request 0 */
    Ifx_SRC_VADCCG CG[2];                   /**< \brief E0, VADCCG Service requests */
} Ifx_SRC_GVADC;

/** \brief  XBAR Service requests */
typedef volatile struct _Ifx_SRC_GXBAR
{
    Ifx_SRC_XBAR XBAR[3];                   /**< \brief 0, XBAR Service requests */
} Ifx_SRC_GXBAR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Src_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  SRC object */
typedef volatile struct _Ifx_SRC
{
    Ifx_SRC_GCPU CPU;                       /**< \brief 0, CPU Service requests */
    unsigned char reserved_18[8];           /**< \brief 18, \internal Reserved */
    Ifx_SRC_GBCU BCU;                       /**< \brief 20, BCU Service requests */
    unsigned char reserved_28[4];           /**< \brief 28, \internal Reserved */
    Ifx_SRC_GAGBT AGBT;                     /**< \brief 2C, AGBT Service requests */
    Ifx_SRC_GXBAR XBAR;                     /**< \brief 30, XBAR Service requests */
    unsigned char reserved_3C[4];           /**< \brief 3C, \internal Reserved */
    Ifx_SRC_GCERBERUS CERBERUS;             /**< \brief 40, CERBERUS Service requests */
    unsigned char reserved_48[8];           /**< \brief 48, \internal Reserved */
    Ifx_SRC_GASCLIN ASCLIN;                 /**< \brief 50, ASCLIN Service requests */
    unsigned char reserved_B0[12];          /**< \brief B0, \internal Reserved */
    Ifx_SRC_SRCR MTUDONE;                   /**< \brief BC, MTU DONE Service Request m */
    Ifx_SRC_GQSPI QSPI;                     /**< \brief C0, QSPI Service requests */
    unsigned char reserved_138[32];         /**< \brief 138, \internal Reserved */
    Ifx_SRC_SRCR QSPI2HC;                   /**< \brief 158, QSPI 2 High Speed Capture Service Request */
    Ifx_SRC_SRCR QSPI3HC;                   /**< \brief 15C, QSPI 3 High Speed Capture Service Request */
    Ifx_SRC_GHSCT HSCT;                     /**< \brief 160, HSCT Service requests */
    unsigned char reserved_168[8];          /**< \brief 168, \internal Reserved */
    Ifx_SRC_GHSSL HSSL;                     /**< \brief 170, HSSL Service requests */
    unsigned char reserved_1F8[8];          /**< \brief 1F8, \internal Reserved */
    Ifx_SRC_GI2C I2C;                       /**< \brief 200, I2C Service requests */
    Ifx_SRC_GSENT SENT;                     /**< \brief 220, SENT Service requests */
    unsigned char reserved_248[8];          /**< \brief 248, \internal Reserved */
    Ifx_SRC_GMSC MSC;                       /**< \brief 250, MSC Service requests */
    Ifx_SRC_GCCU6 CCU6;                     /**< \brief 2A0, CCU6 Service requests */
    unsigned char reserved_2C0[32];         /**< \brief 2C0, \internal Reserved */
    Ifx_SRC_GGPT12 GPT12;                   /**< \brief 2E0, GPT12 Service requests */
    Ifx_SRC_GSTM STM;                       /**< \brief 300, STM Service requests */
    Ifx_SRC_GFCE FCE;                       /**< \brief 330, FCE Service requests */
    Ifx_SRC_GDMA DMA;                       /**< \brief 340, DMA Service requests */
    Ifx_SRC_SRCR PDMAERR;                   /**< \brief 550, PDMA Error Service Request */
    Ifx_SRC_SRCR PDMARDY;                   /**< \brief 554, PDMA ReadyService Request */
    unsigned char reserved_558[8];          /**< \brief 558, \internal Reserved */
    Ifx_SRC_GETH ETH;                       /**< \brief 560, ETH Service requests */
    Ifx_SRC_GCAN CAN;                       /**< \brief 580, CAN Service requests */
    unsigned char reserved_640[48];         /**< \brief 640, \internal Reserved */
    Ifx_SRC_GVADC VADC;                     /**< \brief 670, VADC Service requests */
    Ifx_SRC_GDSADC DSADC;                   /**< \brief 770, DSADC Service requests */
    unsigned char reserved_7E0[32];         /**< \brief 7E0, \internal Reserved */
    Ifx_SRC_GERAY ERAY;                     /**< \brief 800, ERAY Service requests */
    Ifx_SRC_SRCR PMUHOST;                   /**< \brief 860, PMU HOST Service Request */
    Ifx_SRC_SRCR PMUFSI;                    /**< \brief 864, PMU FSI Service Request */
    unsigned char reserved_868[8];          /**< \brief 868, \internal Reserved */
    Ifx_SRC_GHSM HSM;                       /**< \brief 870, HSM Service requests */
    unsigned char reserved_878[8];          /**< \brief 878, \internal Reserved */
    Ifx_SRC_SRCR SCUERU[4];                 /**< \brief 880, SCU ERU Service Request */
    unsigned char reserved_890[12];         /**< \brief 890, \internal Reserved */
    Ifx_SRC_SRCR PMSDTS;                    /**< \brief 89C, SCU PMS DTS Service Request */
    Ifx_SRC_GPMS PMS;                       /**< \brief 8A0, PMS Service requests */
    Ifx_SRC_SRCR SCR;                       /**< \brief 8B0, Stand By Controller Service Request */
    unsigned char reserved_8B4[12];         /**< \brief 8B4, \internal Reserved */
    Ifx_SRC_GSMU SMU;                       /**< \brief 8C0, SMU Service requests */
    unsigned char reserved_8CC[4];          /**< \brief 8CC, \internal Reserved */
    Ifx_SRC_GPSI5 PSI5;                     /**< \brief 8D0, PSI5 Service requests */
    unsigned char reserved_8F0[16];         /**< \brief 8F0, \internal Reserved */
    Ifx_SRC_GDAM DAM;                       /**< \brief 900, DAM Service requests */
    Ifx_SRC_GCIF CIF;                       /**< \brief 930, CIF Service requests */
    unsigned char reserved_940[16];         /**< \brief 940, \internal Reserved */
    Ifx_SRC_GPSI5S PSI5S;                   /**< \brief 950, PSI5S Service requests */
    Ifx_SRC_GRIF RIF;                       /**< \brief 970, RIF Service requests */
    Ifx_SRC_GSPU SPU;                       /**< \brief 980, SPU Service requests */
    Ifx_SRC_GGPSR GPSR;                     /**< \brief 990, GPSR Service requests */
    unsigned char reserved_A50[32];         /**< \brief A50, \internal Reserved */
    Ifx_SRC_GGTM GTM;                       /**< \brief A70, GTM Service requests */
    unsigned char reserved_FF8[8];          /**< \brief FF8, \internal Reserved */
} Ifx_SRC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSRC_REGDEF_H */
